checkfree/src/test/resources/expected/execute/licensemanagerExpected1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://ws.licmgr.eos.ecomm.rim.com/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header/><SOAP-ENV:Body><entitlementRequest xmlns="http://ws.licmgr.eos.ecomm.rim.com/"><tns:ecommOrderNumber></tns:ecommOrderNumber><tns:endCustomer><tns:accountId>2</tns:accountId><tns:address><tns:city>4</tns:city><tns:country></tns:country><tns:phoneNumber></tns:phoneNumber><tns:postalCode></tns:postalCode><tns:state></tns:state><tns:street1></tns:street1><tns:street2></tns:street2></tns:address><tns:name>***NO DATA***</tns:name></tns:endCustomer><tns:globalOrderNumber></tns:globalOrderNumber><tns:orderSource></tns:orderSource><tns:partner><tns:accountId></tns:accountId><tns:address><tns:city></tns:city><tns:country></tns:country><tns:phoneNumber></tns:phoneNumber><tns:postalCode></tns:postalCode><tns:state></tns:state><tns:street1></tns:street1><tns:street2></tns:street2></tns:address><tns:name></tns:name></tns:partner><tns:systemId></tns:systemId><tns:transactionID></tns:transactionID></entitlementRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>